#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ultrasound-probes/terraform-github/runs/run-eeSM1WTZ25kGzybU

Waiting for the plan to start...

Terraform v0.15.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_repository.this["airflow-dags"]: Refreshing state... [id=airflow-dags]
github_repository.this["terraform-oci-vcn"]: Refreshing state... [id=terraform-oci-vcn]
github_repository.this["WIDH-UP"]: Refreshing state... [id=WIDH-UP]
github_repository.this["terraform-cloud"]: Refreshing state... [id=terraform-cloud]
github_repository.this["terraform-github"]: Refreshing state... [id=terraform-github]
github_branch_protection.this["terraform-cloud"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjAzMjgwMDA=]
github_branch_protection.this["terraform-github"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjAzMjc5OTk=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.this["terraform-oci-bastion"] will be created
  + resource "github_repository" "this" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Terraform module to provision ssh bastion to access private subnets"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Terraform"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "terraform-oci-bastion"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>
*Pusher: @Blizter, Action: `pull_request`*